from string import Template

####  RAG PROMPTS  ####

#### SYSTEM TEMPLATES (عربي) ####

system_prompt = Template("\n".join([
    "أنت مساعد لتوليد رد للمستخدم.",
    "سيتم تزويدك بمجموعة من المستندات المرتبطة باستفسار المستخدم.",
    "عليك توليد رد استنادًا إلى المستندات المقدمة. تجاهل المستندات التي ليست ذات صلة باستفسار المستخدم.",
    "عليك توليد رد استنادًا إلى المستندات المقدمة.",
    "تجاهل المستندات التي ليست ذات صلة باستفسار المستخدم.",
    "يمكنك الاعتذار للمستخدم إذا لم تتمكن من توليد رد.",
    "عليك توليد الرد بنفس اللغة التي استخدمها المستخدم في سؤاله.",
    "كن مهذبًا ومحترمًا تجاه المستخدم.",
    "كن دقيقًا ومختصرًا في ردك. تجنب المعلومات غير الضرورية.",
]))

#### DOCUMENT TEMPLATE (عربي) ####

document_prompt = Template(
    "\n".join([
        "## المستند رقم: $doc_num",
        "### المحتوى: $chunk_text",
    ])
)

####  FOOTER TEMPLATE (عربي) ####

footer_prompt = Template(
    "\n".join([
        "استنادًا فقط إلى المستندات أعلاه، يرجى توليد إجابة للمستخدم.",
        "## السؤال :",
        "$query",
        "",
        "## الإجابة:"
    ])
)
